function B=zigzag1(A)
% 函数zigzag1，对8*8矩阵进行Zig-Zag扫描
% 输入变量： 8*8矩阵A
% 返回值：   对A进行zigzag扫描得到的64*1向量

    [a,b]=size(A);  %获取输入矩阵大小
    if(a==8&&b==8)  %满足矩阵为8*8的要求
        %设定扫描的顺序
        zigzag_index= [ 1,9,2,3,10,17,25,18,11,4,5,12,19,26,33,41,34,27,20,13,6,7,14,...
                        21,28,35,42,49,57,50,43,36,29,22,15,8,16,23,30,37,44,51,58,59,...
                        52,45,38,31,24,32,39,46,53,60,61,54,47,40,48,55,62,63,56,64];
        else error('函数的输入不符合要求!要求输入为8*8矩阵');    %输入不符合要求
    end
    B=A(zigzag_index); % 按照zigzag_index设定的顺序得到矩阵A的zig-zag 扫描结果
    
end