function B=zigzag2(A)
%函数zigzag2，对8*8矩阵进行Zig-Zag扫描
%输入变量：	8*8矩阵A
%返回值：  对A进行zigzag扫描得到的64*1向量

	[a,b]=size(A);  %获取输入矩阵大小
	if(a==8&&b==8)  %满足矩阵为8*8的要求
        %设定扫描顺序与矩阵的对应关系
        zigzag_index=[  1, 2, 6, 7, 15,16,28,29;
                        3, 5, 8, 14,17,27,30,43;
                        4, 9, 13,18,26,31,42,44;
                        10,12,19,25,32,41,45,54;
                        11,20,24,33,40,46,53,55;
                        21,23,34,39,47,52,56,61;
                        22,35,38,48,51,57,60,62;
                        36,37,49,50,58,59,63,64;];
        else error('函数的输入不符合要求!\n要求输入为8*8矩阵');   %输入不符合要求
	end
	for i=1:8
        for j=1:8
            B(zigzag_index(i,j))=A(i,j);	%,按照zigzag_index与矩阵A的zig-zag的对应输出扫描结果
        end
    end
end